Revit 2024 API
StructuralSectionGeneralT.GetWebThicknessInHeightCenter Method
 Returns thickness of web measured in the 0.5 * height,
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double GetWebThicknessInHeightCenter()
Visual Basic
Public Function GetWebThicknessInHeightCenter As Double
Visual C++
public:
double GetWebThicknessInHeightCenter()
See Also
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace